---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CutterFailures.MakeCutterForSectionGStepFailed
source: html/7b7c563c-a610-84b0-c171-849fbf94c2ee.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CutterFailures.MakeCutterForSectionGStepFailed Property

Attempt to create or manipulate a segmented section has failed.

## Syntax (C#)
```csharp
public static FailureDefinitionId MakeCutterForSectionGStepFailed { get; }
```